///----------------------------------------------------------------------------|
/// ...
///----------------------------------------------------------------------------:
#include <iostream>
#include <sstream>
#include <fstream>
#include <format>


struct ConfigTest
{
    /*
        Имя игрока Шанс 300+100
        Имя игрока / текущий статус (цифра)
        Покупка номер ячейки/статус ячейки цифра.
        (средняя цена)/ цена покупки.
    */

    ///------------------------------------------------------------------------|
    /// Чтобы убрать параметр из логов, нужно закомментить его в 2 местах.
    /// Ниже пример для chance.
    ///------------------------------------------------------------------------:
    void _2log
    (   std::string_view  name,
        unsigned       capital,
        unsigned        chance,
        unsigned  statusPerson,
        unsigned        idCell,
        unsigned    statusCell,
        unsigned     priseBase,
        unsigned     priseBuy
    )
    {   std::stringstream ss;
        std::cout << std::format
        (
            "|--------------------------------------------------------------:\n"
            "Имя:{}, "
        /// "Монеты:{}, "
            "Шанс:{}, "
            "Статус-игрока:{}, \n"
            "#-ячейки:{}, "
            "Статус-ячейки:{}, "
            "Цена базовая:{}, "
            "Цена-покупки:{}.\n",

            name        ,
        /// capital     ,
            chance      ,
            statusPerson,
            idCell      ,
            statusCell  ,
            priseBase   ,
            priseBuy
        );

        std::cout << ss.str() << '\n';
        fileLog   << ss.str() << '\n';

    }

    ///---------------------------------------|
    /// Подвал.                               |
    ///---------------------------------------:
private:
    std::ofstream fileLog;
    bool is2Log{true};
    void init()
    {
        if(is2Log) fileLog.open("log4rus.txt");
    }
    friend void tests();
};


///----------------------------------------------------------------------------|
/// Все тесты классов.
///---------------------------------------------------------------------- tests:
void tests()
{
    ConfigTest  test;
                test.init();
                test._2log("Bob" , 300, 1, 2, 12, 0, 120,  90);
                test._2log("Pete", 400, 0, 0,  4, 1, 100, 110);
}


///----------------------------------------------------------------------------|
/// Старт программы.
///----------------------------------------------------------------------- main:
int main()
{
    std::system( "chcp 65001>nul" );

    std::cout << "Привет, Мир!\n\n" << std::endl;

    tests();

    std::cout << "Программа закончила работу.\n" << std::endl;

    return 0;
}
