#ifndef USER_MODEL_H
#define USER_MODEL_H
const char* const LOGO = "Model::Monopoly-2025[ver::0.2.4]";
///----------------------------------------------------------------------------|
/// "user-model.h"
///----------------------------------------------------------------------------:
#include <string>
#include <vector>

namespace model
{

    struct ConfigShare
    {
        ///------------------------------|
        /// Индекс игры.                 |
        ///------------------------------:
        unsigned idGame             { 0 };

        ///------------------------------|
        /// Количество ячеек на поле.    |
        ///------------------------------:
        unsigned amountCells       { 30 };

        ///------------------------------|
        /// Мировая геометрия.           |
        ///------------------------------:
        std::vector<std::vector<int>> worldGeometry
        {   { -1,  0,  1,  2, -1,  6,  7,  8, -1 },
            { 28, 29, -1,  3,  4,  5, -1,  9, 10 },
            { 27, -1, -1, -1, -1, -1, -1, -1, 11 },
            { 26, -1, -1, -1, -1, -1, -1, -1, 12 },
            { 25, 24, -1, 20, 19, 18, -1, 14, 13 },
            { -1, 23, 22, 21, -1, 17, 16, 15, -1 }
        };

        ///-----------------------------------------------|
        /// Дебажные нстройки.                            |
        ///-----------------------------------------------:
        ///------------------------------|
        /// Кол-во итераций в файл.      |
        /// 0 - вывод в консоль.         |
        ///------------------------------:
        static unsigned& isDump2File()
        {   static unsigned CountCircles{0};
            return CountCircles;
        }

        ///------------------------------|
        /// Скроллить консоль?.          |
        ///------------------------------:
        bool isScrollConsole{/*ДА:*/true};
        ///-----------------------------------------------.
    };

    ///---------------------------|
    /// Стейт визуализатора игры. |
    ///---------------------------:
    struct StateGame : std::vector<int>
    {
        enum eSTATE
        {    E_SIZE    ,
             E_IDPLAYER,
             E_NDICE   ,
             E_POSITION
        };
    };

    ///---------------------------|
    /// vsl.                      |
    ///---------------------------:
    ConfigShare* getConfig();

    std::string  getLogo(unsigned id);

    ///---------------------------|
    /// controller.               |
    ///---------------------------:
    std::string doStep(std::string_view command, const std::vector<int>& args);

    ///---------------------------|
    /// Кто Победитель.           |
    ///---------------------------:
    size_t whoVictor(unsigned idGame);

    ///---------------------------|
    /// Что должен знать игрок.   |
    ///---------------------------:
    const StateGame getStateGame(std::string_view command,
                                  const std::vector<int>& args);
}

#endif // USER_MODEL_H
