#include <iostream>
#include <string>
#include <vector>

///----------------------------------|
/// Для удобства чтения?             |
/// Array1U это одномерный           |
/// массив из натуральных числе.     |
///----------------------------------:
using Array1U = std::vector<unsigned>;

///----------------------------------------------------------------------------|
/// Описание(класс) ячейки на карте.
///----------------------------------------------------------------------------:
struct  Cell
{       Cell(const Array1U& init) : statuses(init)
        {
        }

    unsigned getStatus(unsigned number) const { return statuses[number]; }

private:

    ///------------------------------|
    /// Массив со статусами.         |
    ///------------------------------:
    Array1U statuses;

    ///------------------------------|
    /// Ячейка может иметь ID.       |
    ///------------------------------:
    unsigned id;

    ///------------------------------|
    /// Тут тест этого класса.       |
    ///------------------------------:
    static void test()
    {
        {   Cell         cell  ( {1,2,3} );
            std::cout << cell << std::endl;
        }

        {   Array1U           m{2,3, 1};
            Cell         cell(m);
            std::cout << cell << std::endl;
        }
    }

    ///------------------------------|
    /// Друзья приватных методов.    |
    ///------------------------------:
    friend std::ostream& operator<<(std::ostream& o, const Cell& cell);
    friend void tests();
};


///----------------------------------|
/// Вывод Cell в консоль.            |
///----------------------------------:
std::ostream& operator<<(std::ostream& o, const Cell& cell)
{   o << "statusCell: ";
    for(const auto status : cell.statuses) o << status;
    return o;
}


///----------------------------------------------------------------------------|
/// Все тесты классов.
///----------------------------------------------------------------------------:
void tests()
{
    Cell::test();
}


///----------------------------------------------------------------------------|
/// Старт программы.
///----------------------------------------------------------------------------:
int main()
{
    std::system("chcp 65001");
    std::cout << "Привет Мир!" << std::endl;

    tests();

    return 0;
}
